app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("name", "stars", "comment", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Ali"], ["stars", 2], ["comment", "mmm not so much"], ["movie_id", 6], ["created_at", 2016-09-13 10:37:31 UTC], ["updated_at", 2016-09-13 10:37:31 UTC]]
---
	def create
		@review = @movie.reviews.new(review_params)
		if @review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT ?  [["movie_id", 6], ["id", 8], ["LIMIT", 1]]
---
	def edit
		@review = @movie.reviews.find(params[:id])

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT ?  [["movie_id", 6], ["id", 8], ["LIMIT", 1]]
UPDATE "reviews" SET "stars" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["stars", 2], ["updated_at", 2016-09-17 08:43:45 UTC], ["id", 8]]
---
	def update
		@review = @movie.reviews.find(params[:id])
		if @review.update(review_params)

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT ?  [["movie_id", 6], ["id", 5], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 5]]
---
	def destroy
		@review = @movie.reviews.find(params[:id])
		@review.destroy